[Survived] EqualityOperator
src/lib/reminderNotify.ts:22:29
-       if (!Number.isNaN(t) && t <= Date.now()) return true;
+       if (!Number.isNaN(t) && t < Date.now()) return true;
Tests ran:
    reminderNotify — mutation-hardened edge cases treats legacy id-only markers as notified only for past slots
    reminderNotify allows a future reschedule after a legacy id-only marker

[Survived] ConditionalExpression
src/lib/reminderNotify.ts:32:16
-       (entry) => entry !== id && reminderNotifyEntryId(entry) !== id,
+       (entry) => true && reminderNotifyEntryId(entry) !== id,
Tests ran:
    workspace items removeItem clears reminder notify keys
    core actions — data safety removeTodoItem clears notifiedReminderIds for that item
    due vs reminder — invariants changing remindAt clears notified keys so the new slot can fire
  and 3 more tests!
